jmeter.log
2020-04-26 14:51:57,197 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2020-04-26 14:51:57,204 INFO o.a.j.JMeter: Loading user properties from: C:\Pavan\Downloads\apache-jmeter-5.1.1\bin\user.properties
2020-04-26 14:51:57,204 INFO o.a.j.JMeter: Loading system properties from: C:\Pavan\Downloads\apache-jmeter-5.1.1\bin\system.properties
2020-04-26 14:51:57,208 INFO o.a.j.JMeter: Copyright (c) 1998-2019 The Apache Software Foundation
2020-04-26 14:51:57,208 INFO o.a.j.JMeter: Version 5.1.1 r1855137
2020-04-26 14:51:57,208 INFO o.a.j.JMeter: java.version=1.8.0_152
2020-04-26 14:51:57,208 INFO o.a.j.JMeter: java.vm.name=Java HotSpot(TM) Client VM
2020-04-26 14:51:57,208 INFO o.a.j.JMeter: os.name=Windows 10
2020-04-26 14:51:57,208 INFO o.a.j.JMeter: os.arch=x86
2020-04-26 14:51:57,208 INFO o.a.j.JMeter: os.version=10.0
2020-04-26 14:51:57,208 INFO o.a.j.JMeter: file.encoding=Cp1252
2020-04-26 14:51:57,208 INFO o.a.j.JMeter: java.awt.headless=true
2020-04-26 14:51:57,209 INFO o.a.j.JMeter: Max memory     =1073741824
2020-04-26 14:51:57,209 INFO o.a.j.JMeter: Available Processors =16
2020-04-26 14:51:57,211 INFO o.a.j.JMeter: Default Locale=English (EN)
2020-04-26 14:51:57,211 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2020-04-26 14:51:57,211 INFO o.a.j.JMeter: JMeterHome=C:\Pavan\Downloads\apache-jmeter-5.1.1
2020-04-26 14:51:57,211 INFO o.a.j.JMeter: user.dir  =C:\Working\Automation POC\Git\JmeterTemplates
2020-04-26 14:51:57,211 INFO o.a.j.JMeter: PWD       =C:\Working\Automation POC\Git\JmeterTemplates
2020-04-26 14:51:57,213 INFO o.a.j.JMeter: IP: 192.168.0.9 Name: 4CCFZY2 FullName: host.docker.internal
2020-04-26 14:51:57,213 INFO o.a.j.JMeter: search_paths=../../Plugins
2020-04-26 14:51:57,213 WARN o.a.j.JMeter: Can't read ../../Plugins
2020-04-26 14:51:57,215 INFO o.a.j.JMeter: Setting property 'jmeter.reportgenerator.outputdir' to:'C:\Working\Automation POC\Git\JmeterTemplates\TempChartResults'
2020-04-26 14:51:57,216 INFO o.a.j.s.FileServer: Default base='C:\Working\Automation POC\Git\JmeterTemplates'
2020-04-26 14:51:57,218 INFO o.a.j.s.FileServer: Set new base='C:\Working\Automation POC\Git\JmeterTemplates'
2020-04-26 14:51:57,312 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2020-04-26 14:51:57,320 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2020-04-26 14:51:57,323 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2020-04-26 14:51:57,327 INFO o.a.j.s.SaveService: Loading file: C:\Working\Automation POC\Git\JmeterTemplates\Basic Jmeter.jmx
2020-04-26 14:51:57,359 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2020-04-26 14:51:57,359 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2020-04-26 14:51:57,359 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2020-04-26 14:51:57,359 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2020-04-26 14:51:57,359 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2020-04-26 14:51:57,359 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2020-04-26 14:51:57,382 INFO o.a.j.JMeter: Creating summariser <summary>
2020-04-26 14:51:57,385 INFO o.a.j.r.d.ReportGenerator: ReportGenerator will use for Parsing the separator: ','
2020-04-26 14:51:57,385 INFO o.a.j.r.d.ReportGenerator: Will generate report at end of test from  results file: C:\Working\Automation POC\Git\JmeterTemplates\TestResults.csv
2020-04-26 14:51:57,385 INFO o.a.j.r.d.ReportGenerator: Reading report generator properties from: C:\Pavan\Downloads\apache-jmeter-5.1.1\bin\reportgenerator.properties
2020-04-26 14:51:57,386 INFO o.a.j.r.d.ReportGenerator: Merging with JMeter properties
2020-04-26 14:51:57,389 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.temp_dir' not found, using default value 'temp' instead.
2020-04-26 14:51:57,391 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.apdex_per_transaction' not found, using default value 'null' instead.
2020-04-26 14:51:57,391 INFO o.a.j.r.c.ReportGeneratorConfiguration: apdex_per_transaction : {} is empty, not APDEX per transaction customization
2020-04-26 14:51:57,391 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.sample_filter' not found, using default value 'null' instead.
2020-04-26 14:51:57,391 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.report_title' not found, using default value 'null' instead.
2020-04-26 14:51:57,391 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.start_date' not found, using default value 'null' instead.
2020-04-26 14:51:57,391 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.end_date' not found, using default value 'null' instead.
2020-04-26 14:51:57,391 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.date_format' not found, using default value 'null' instead.
2020-04-26 14:51:57,391 INFO o.a.j.r.c.ReportGeneratorConfiguration: Will use date range start date: null, end date: null
2020-04-26 14:51:57,395 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.totalTPS.exclude_controllers' not found, using default value 'false' instead.
2020-04-26 14:51:57,395 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.activeThreadsOverTime.exclude_controllers' not found, using default value 'false' instead.
2020-04-26 14:51:57,395 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.timeVsThreads.exclude_controllers' not found, using default value 'false' instead.
2020-04-26 14:51:57,395 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimeDistribution.exclude_controllers' not found, using default value 'false' instead.
2020-04-26 14:51:57,395 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.transactionsPerSecond.exclude_controllers' not found, using default value 'false' instead.
2020-04-26 14:51:57,395 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentiles.exclude_controllers' not found, using default value 'false' instead.
2020-04-26 14:51:57,395 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentilesOverTime.exclude_controllers' not found, using default value 'false' instead.
2020-04-26 14:51:57,395 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimesOverTime.exclude_controllers' not found, using default value 'false' instead.
2020-04-26 14:51:57,395 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.connectTimeOverTime.exclude_controllers' not found, using default value 'false' instead.
2020-04-26 14:51:57,396 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.latenciesOverTime.exclude_controllers' not found, using default value 'false' instead.
2020-04-26 14:51:57,396 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.filters_only_sample_series' not found, using default value 'true' instead.
2020-04-26 14:51:57,396 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.series_filter' not found, using default value '' instead.
2020-04-26 14:51:57,396 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.show_controllers_only' not found, using default value 'false' instead.
2020-04-26 14:51:57,397 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.filters_only_sample_series' not found, using default value 'true' instead.
2020-04-26 14:51:57,397 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.series_filter' not found, using default value '' instead.
2020-04-26 14:51:57,397 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.show_controllers_only' not found, using default value 'false' instead.
2020-04-26 14:51:57,403 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2020-04-26 14:51:57,404 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2020-04-26 14:51:57,404 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2020-04-26 14:51:57,408 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2020-04-26 14:51:57,408 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2020-04-26 14:51:57,617 INFO o.a.j.JMeter: Running test (1587937917617)
2020-04-26 14:51:57,640 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Thread Group - Simple google.com
2020-04-26 14:51:57,640 INFO o.a.j.e.StandardJMeterEngine: Starting 1 threads for group Thread Group - Simple google.com.
2020-04-26 14:51:57,640 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2020-04-26 14:51:57,640 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=1 ramp-up=1 delayedStart=false
2020-04-26 14:51:57,644 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2020-04-26 14:51:57,644 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2020-04-26 14:51:57,645 INFO o.a.j.t.JMeterThread: Thread started: Thread Group - Simple google.com 1-1
2020-04-26 14:51:57,657 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = 4CCFZY2
2020-04-26 14:51:57,661 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2020-04-26 14:51:57,662 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2020-04-26 14:51:57,662 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to ISO-8859-1
2020-04-26 14:51:57,662 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2020-04-26 14:51:57,662 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2020-04-26 14:51:58,420 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group - Simple google.com 1-1
2020-04-26 14:51:58,420 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group - Simple google.com 1-1
2020-04-26 14:51:58,421 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2020-04-26 14:51:58,422 INFO o.a.j.r.Summariser: summary =      2 in 00:00:01 =    2.5/s Avg:   358 Min:   171 Max:   545 Err:     1 (50.00%)
2020-04-26 14:51:58,422 INFO o.a.j.JMeter: Generating Dashboard
2020-04-26 14:51:58,422 INFO o.a.j.r.d.ReportGenerator: Flushing result collector before report Generation
2020-04-26 14:51:58,432 INFO o.a.j.r.p.NormalizerSampleConsumer: Using format, 'yyyy/MM/dd HH:mm:ss.SSS', to parse timeStamp field
2020-04-26 14:51:58,767 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.AggregateConsumer#stopProducing(): beginDate produced 0 samples
2020-04-26 14:51:58,767 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.AggregateConsumer#stopProducing(): endDate produced 0 samples
2020-04-26 14:51:58,768 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.ApdexSummaryConsumer#stopProducing(): apdexSummary produced 0 samples
2020-04-26 14:51:58,768 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.RequestsSummaryConsumer#stopProducing(): requestsSummary produced 0 samples
2020-04-26 14:51:58,773 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.StatisticsSummaryConsumer#stopProducing(): statisticsSummary produced 0 samples
2020-04-26 14:51:58,775 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.Top5ErrorsBySamplerConsumer#stopProducing(): top5ErrorsBySampler produced 0 samples
2020-04-26 14:51:58,775 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.ErrorsSummaryConsumer#stopProducing(): errorsSummary produced 0 samples
2020-04-26 14:51:58,775 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.HitsPerSecondGraphConsumer#stopProducing(): hitsPerSecond produced 0 samples
2020-04-26 14:51:58,784 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.LatencyVSRequestGraphConsumer#stopProducing(): latencyVsRequest produced 0 samples
2020-04-26 14:51:58,785 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.SyntheticResponseTimeDistributionGraphConsumer#stopProducing(): syntheticResponseTimeDistribution produced 0 samples
2020-04-26 14:51:58,785 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.BytesThroughputGraphConsumer#stopProducing(): bytesThroughputOverTime produced 0 samples
2020-04-26 14:51:58,785 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.CodesPerSecondGraphConsumer#stopProducing(): codesPerSecond produced 0 samples
2020-04-26 14:51:58,787 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeVSRequestGraphConsumer#stopProducing(): responseTimeVsRequest produced 0 samples
2020-04-26 14:51:58,787 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): startIntervalControlerFilter produced 14 samples
2020-04-26 14:51:58,787 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TotalTPSGraphConsumer#stopProducing(): totalTPS produced 0 samples
2020-04-26 14:51:58,787 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ActiveThreadsGraphConsumer#stopProducing(): activeThreadsOverTime produced 0 samples
2020-04-26 14:51:58,788 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TimeVSThreadGraphConsumer#stopProducing(): timeVsThreads produced 0 samples
2020-04-26 14:51:58,788 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeDistributionGraphConsumer#stopProducing(): responseTimeDistribution produced 0 samples
2020-04-26 14:51:58,788 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TransactionsPerSecondGraphConsumer#stopProducing(): transactionsPerSecond produced 0 samples
2020-04-26 14:51:58,788 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimePercentilesGraphConsumer#stopProducing(): responseTimePercentiles produced 0 samples
2020-04-26 14:51:58,788 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimePercentilesOverTimeGraphConsumer#stopProducing(): responseTimePercentilesOverTime produced 0 samples
2020-04-26 14:51:58,789 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeOverTimeGraphConsumer#stopProducing(): responseTimesOverTime produced 0 samples
2020-04-26 14:51:58,789 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ConnectTimeOverTimeGraphConsumer#stopProducing(): connectTimeOverTime produced 0 samples
2020-04-26 14:51:58,789 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.LatencyOverTimeGraphConsumer#stopProducing(): latenciesOverTime produced 0 samples
2020-04-26 14:51:58,789 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): nameFilter produced 30 samples
2020-04-26 14:51:58,789 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): dateRangeFilter produced 6 samples
2020-04-26 14:51:58,789 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.NormalizerSampleConsumer#stopProducing(): normalizer produced 2 samples
2020-04-26 14:51:58,789 INFO o.a.j.r.p.CsvFileSampleSource: produce(): 2 samples produced in 342ms on channel 0
2020-04-26 14:51:58,789 INFO o.a.j.r.d.ReportGenerator: Exporting data using exporter:'json' of className:'org.apache.jmeter.report.dashboard.JsonExporter'
2020-04-26 14:51:58,790 INFO o.a.j.r.d.JsonExporter: Found data for consumer statisticsSummary in context
2020-04-26 14:51:58,790 INFO o.a.j.r.d.JsonExporter: Creating statistics for overall
2020-04-26 14:51:58,791 INFO o.a.j.r.d.JsonExporter: Creating statistics for other transactions
2020-04-26 14:51:58,791 INFO o.a.j.r.d.JsonExporter: Checking output folder
2020-04-26 14:51:58,791 INFO o.a.j.r.d.JsonExporter: Writing statistics JSON to C:\Working\Automation POC\Git\JmeterTemplates\TempChartResults\statistics.json
2020-04-26 14:51:58,890 INFO o.a.j.r.d.ReportGenerator: Exporting data using exporter:'html' of className:'org.apache.jmeter.report.dashboard.HtmlTemplateExporter'
2020-04-26 14:51:58,892 INFO o.a.j.r.d.HtmlTemplateExporter: Will generate dashboard in folder: C:\Working\Automation POC\Git\JmeterTemplates\TempChartResults
2020-04-26 14:51:58,944 INFO o.a.j.r.d.HtmlTemplateExporter: Report will be generated in: C:\Working\Automation POC\Git\JmeterTemplates\TempChartResults, creating folder structure
2020-04-26 14:51:58,946 INFO o.a.j.r.d.TemplateVisitor: Copying folder from 'C:\Pavan\Downloads\apache-jmeter-5.1.1\bin\report-template' to 'C:\Working\Automation POC\Git\JmeterTemplates\TempChartResults', got message:[C:\Working\Automation POC\Git\JmeterTemplates\TempChartResults\statistics.json], found non empty folder with following content {}, will be ignored
2020-04-26 14:51:59,286 INFO o.a.j.JMeter: Dashboard generated